web-interface/app/views/user_groups/new.html.erb

SELECT `users`.* FROM `users`
---
					<option value="">Select users</option>
					<% User.all.each do |user| %>