web-interface/app/controllers/user_groups_controller.rb

INSERT INTO `user_groups` (`name`, `created_at`, `updated_at`) VALUES ('Second years', '2018-04-03 17:59:58', '2018-04-03 17:59:58')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
  	group_name = params["name"]
  	users = params["users"].split(",")
  	UserGroup.create(name: group_name, users: users.map {|id|User.find(id)})