web-interface/app/views/bookings/new.html.erb

SELECT `user_groups`.* FROM `user_groups`
---
					<option value="">Student group</option>
					<% UserGroup.all.each do |user_group| %>